Repository: keymanapp/keyman
Catalog: ios/engine/KMEI/KeymanEngine/*.lproj/Localizable.strings
Languages: am, ar, az, cs, de, el, es, fr, it, km, kn, kr, nl, pl, pt_pt, ru, sv, vi, zh_hans

# alert-download-error-busy
source: Already busy downloading.
am: ለማውረድ በጣም ተቸግሯል።
ar: يجري التحميل بالفعل.
az: Artıq endirilir.
cs: Stahování již bylo zaneprázdněno.
de: Download wird bereits ausgeführt.
el: Λήψη ἤδη σὲ ἐξέλιξη.
es: Ya estoy ocupado descargando.
fr: Téléchargement déjà en cours.
it: Già occupato a scaricare.
km: កំពុង​តែ​ទាញយកស្រាប់ហើយ​។
kn: ಈಗಾಗಲೇ ಡೌನ್‌ಲೋಡ್‌ನಲ್ಲಿ ನಿರತವಾಗಿದೆ.
kr: Downloading sǝdinna kara.
nl: Al bezig met downloaden.
pl: Zajęty pobieraniem.
pt_pt: Baixando já ocupado.
ru: Загрузка уже занята.
sv: Redan upptagen med nedladdning.
vi: Đang bận tải xuống.
zh_hans: 已经在忙着下载。

# alert-download-error-detail
source: Error occurred during download or installation.
am: በማውረድም ሆነ በመጫን ላይ ችግሮች ተከስተዋል።
ar: حدث خطأ أثناء التحميل أو التثبيت.
az: Endirmə və ya quraşdırma zamanı xəta baş verdi.
cs: Při stahování nebo instalaci došlo k chybě.
de: Beim Herunterladen oder der Installation ist ein Fehler aufgetreten.
el: Παρουσιάσθηκε σφάλμα κατὰ τὴν λήψη ἢ ἐγκατάσταση.
es: Se ha producido un error durante la descarga o la instalación.
fr: Une erreur s'est produite lors du téléchargement ou de l'installation.
it: Si è verificato un errore durante il download o l'installazione.
km: បញ្ហា​បាន​កើត​ឡើង​ពេល​កំពុង​ទាញយក ឬ​ពេល​កំពុង​ដំឡើង។
kn: ಡೌನ್‌ಲೋಡ್ ಮಾಡುವಾಗ ಅಥವ ಅನುಸ್ಥಾಪಿಸುವಾಗ ದೋಷ ಸಂಭವಿಸಿದೆ.
kr: Taltǝ waazǝna woktu download au tǝkkin dǝn.
nl: Fout opgetreden tijdens het downloaden of installeren.
pl: Wystąpił błąd podczas pobierania lub instalacji.
pt_pt: Ocorreu um erro durante o download ou instalação.
ru: Произошла ошибка во время загрузки или установки.
sv: Fel uppstod under nedladdning eller installation.
vi: Xảy ra lỗi trong quá trình tải xuống hay cài đặt.
zh_hans: 下载或安装过程中发生错误。

# alert-download-error-title
source: Download error
am: የማውረድ ችግሮች
ar: خطأ تحميل
az: Endirmə xətası
cs: Chyba při stahování
de: Fehler beim Herunterladen
el: Σφάλμα κατὰ τὴν λήψη
es: Error de descarga
fr: Erreur de téléchargement
it: Errore di download
km: មាន​បញ្ហា​ក្នុង​ការទាញយក
kn: ಇಳಿಸುವಾಗ ದೋಷ
nl: Download fout
pl: Błąd pobierania
pt_pt: Erro no download
ru: Ошибка загрузки
sv: Fel vid hämtning
vi: Lỗi tải xuống
zh_hans: 下载错误

# alert-no-connection-detail
source: Could not reach Keyman server. Please try again later.
am: የኪይማን ሰርቨርን ማግኘት አልተቻለም፤ እባክዎ እንደገና ይሞክሩ።
ar: تعذر الوصول إلى خادم Keyman. يرجى المحاولة لاحقًا.
az: Keyman serverinə çata bilmədi. Zəhmət olmasa daha sonra yenidən sınayın.
cs: Nelze získat přístup na server Keyman. Opakujte akci později.
de: Der Keyman-Server kann nicht erreicht werden. Bitte versuchen Sie es später erneut.
el: Ἀδυναμία προσβάσεως στὸν διακομιστὴ Κῆμαν. Παρακαλοῦμε ξαναδοκιμάστε ἀργότερα.
es: No se puede conectar con el servidor de Keyman. Por favor, inténtelo de nuevo más tarde.
fr: Impossible d'atteindre le serveur Keyman. Veuillez réessayer plus tard.
it: Impossibile raggiungere il server Keyman. Riprova più tardi.
km: មិន​អាច​ទាក់​ទង​ម៉ាស៊ីនមេ​របស់ Keyman បាន​ទេ។ សូម​ព្យាយាម​ម្ដង​ទៀត​នៅ​ពេល​ក្រោយ។
kn: ಕೀಮ್ಯಾನ್ ಸರ್ವರ್ ಅನ್ನು ಸಂಪರ್ಕಿಸಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲಾ. ದಯವಿಟ್ಟು ಮತ್ತೆ ಪ್ರಯತ್ನಿಸಿ.
kr: Raksǝ keyman server dǝ nazǝyin ba. Martǝne waltǝne jarabne.
nl: Kan de Keyman server niet bereiken. Probeer het later opnieuw.
pl: Nie udało się połączyć z serwerem Keyman. Spróbuj ponownie później.
pt_pt: Não foi possível acessar o servidor Keyman. Por favor, tente novamente mais tarde.
ru: Не удалось подключиться к серверу Keyman. Пожалуйста, повторите попытку позже.
sv: Kunde inte nå Keyman-servern. Försök igen senare.
vi: Không thể truy cập máy chủ Keyman. Xin thử lại sau.
zh_hans: 无法连接到Keyman服务器。请稍后再试。

# alert-no-connection-title
source: Connection Error
am: የኮኔክሽን ችግሮች
ar: خطأ اتصال
az: Bağlantı xətası
cs: Chyba připojení
de: Verbindungsfehler
el: Σφάλμα συνδέσεως
es: Error de conexión
fr: Problème de connexion
it: Errore Di Connessione
km: ការ​តភ្ជាប់​មាន​បញ្ហា
kn: ಸಂಪರ್ಕ ದೋಷ
nl: Verbindingsfout
pl: Błąd połączenia
pt_pt: Erro de conexão
ru: Ошибка соединения
sv: Anslutningsfel
vi: Lỗi kết nối
zh_hans: 连接错误

# command-back
source: Back
am: ተመለስ
ar: عودة
az: Geri
cs: Zpět
de: Zurück
el: Πίσω
es: Atrás
fr: Précédent
it: Indietro
km: ថយក្រោយ
kn: ಹಿಂದೆ
kr: Ngaworo waltǝne
nl: Achterzijde
pl: Wstecz
pt_pt: Voltar
ru: Назад
sv: Tillbaka
vi: Quay lại
zh_hans: 返回

# command-cancel
source: Cancel
am: ይቅር
ar: إلغاء
az: İmtina
cs: Zrušit
de: Abbrechen
el: Ἀκυρῶστε
es: Cancelar
fr: Annuler
it: Annulla
km: បោះ​បង់
kn: ರದ್ದುಮಾಡಿ
kr: Cinne
nl: annuleren
pl: Anuluj
pt_pt: Instalar Mais Tarde
ru: Отменить
sv: Avbryt
vi: Huỷ
zh_hans: 取消

# command-done
source: Done
am: አልቋል
ar: تم
az: Hazırdır
cs: Hotovo
de: Fertig
el: Ἕτοιμοι
es: Completado
fr: Terminé
it: Fatto
km: រួចរាល់
kn: ಆಗಿದೆ
kr: Tamotǝna
nl: Voltooid
pl: Gotowe
pt_pt: Concluído
ru: Готово
sv: Klar
vi: Xong
zh_hans: 完成

# command-install
source: Install
am: ጫን
ar: تثبيت
az: Quraşdır
cs: Instalovat
de: Installieren
el: Ἐγκαταστῆστε
es: Instalar
fr: Installer
it: Installa
km: ដំឡើង
kn: ಅನುಸ್ಥಾಪಿಸು
nl: Installeren
pl: Zainstaluj
pt_pt: Instalar
ru: Установить
sv: Installera
vi: Cài đặt
zh_hans: 安装

# command-next
source: Next
am: ቀጥሎ
ar: التالي
az: Növbəti
cs: Další
de: Weiter
el: Ἑπόμενο
es: Siguiente
fr: Suivant
it: Successivo
km: បន្ទាប់
kn: ಮುಂದಿನ
kr: Fuwu
nl: Volgende
pl: Następny
pt_pt: Próximo
ru: Следующий
sv: Nästa
vi: Tiếp theo
zh_hans: 下一个

# command-ok
source: OK
am: ይሁን
ar: موافق
az: Oldu
es: Aceptar
km: យល់ព្រម
kn: ಸರಿ
kr: YO
ru: ОК
zh_hans: 确定

# command-uninstall
source: Uninstall
am: ይጥፋ
ar: إلغاء تثبيت
az: Sil
cs: Odinstalovat
de: Deinstallieren
el: Ἀπεγκαταστῆστε
es: Desinstalar
fr: Désinstaller
it: Disinstalla
km: លុប​ចេញ
kn: ಅಸ್ಥಾಪಿಸು
nl: De-installeer
pl: Odinstaluj
pt_pt: Desinstalar
ru: Удалить
sv: Avinstallera
vi: Gỡ cài đặt
zh_hans: 卸载

# command-uninstall-keyboard
source: Uninstall keyboard
am: የፊደል ሰሌዳን ማጥፋት
ar: إلغاء تثبيت لوحة المفاتيح
az: Klaviaturanı sil
cs: Odinstalovat klávesnici
de: Tastatur deinstallieren
el: Ἀπεγκαταστῆστε πληκτρολόγιο
es: Desinstalar teclado
fr: Désinstaller ce clavier
it: Disinstalla tastiera
km: លុប​ក្ដារចុចចេញ
kn: ಕೀಲಿಮಣೆಯನ್ನು ಅಸ್ಥಾಪಿಸು
kr: Keyboard dǝga uninstallin diye
nl: Toetsenbord verwijderen
pl: Odinstaluj klawiaturę
pt_pt: Desinstalar teclado
ru: Удалить клавиатуру
sv: Avinstallera tangentbordet
vi: Gỡ cài đặt bàn phím
zh_hans: 卸载键盘

# command-uninstall-keyboard-confirm
source: Would you like to uninstall this keyboard?
am: ይህንን የፊደል ገበታ ልታጠፋው ትፈልጋለህ?
ar: هل ترغب بإزالة تثبيت لوحة المفاتيح هذه؟
az: Bu klaviaturanı silmək istəyirsiniz?
cs: Chcete odinstalovat tuto klávesnici?
de: Möchten Sie diese Tastatur deinstallieren?
el: Θὰ θέλατε νὰ ἀπεγκαταστήσετε αὐτὸ τὸ πληκτρολόγιο;
es: ¿Le gustaría desinstalar este teclado?
fr: Voulez-vous désinstaller ce clavier?
it: Vuoi disinstallare questa tastiera?
km: តើ​អ្នក​ចង់​លុប​ក្ដារចុច​នេះ​ឬ?
kn: ಈ ಕೀಲಿಮಣೆಯನ್ನು ಅಸ್ಥಾಪಿಸಲು ನೀವು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?
kr: Keyboard dǝ tuluwo raama wa?
nl: Wilt u dit toetsenbord deïnstalleren?
pl: Czy chcesz odinstalować tę klawiaturę?
pt_pt: Gostaria de desinstalar este teclado?
ru: Вы хотите удалить эту клавиатуру?
sv: Vill du avinstallera det här tangentbordet?
vi: Bạn có muốn gỡ cài đặt bàn phím này không?
zh_hans: 您想卸载此键盘吗？

# command-uninstall-lexical-model
source: Uninstall dictionary
am: መዝገበ ቃላቱን ማስወገድ
ar: إلغاء تثبيت القاموس
az: Lüğəti sil
cs: Odinstalovat slovník
de: Wörterbuch deinstallieren
el: Ἀπεγκαταστῆστε λεξικό
es: Desinstalar diccionario
fr: Désinstaller ce dictionnaire
it: Disinstalla dizionario
km: លុប​បញ្ជី​ពាក្យ
kn: ನಿಘಂಟನ್ನು ಅಸ್ಥಾಪಿಸು
kr: Dictionary dǝ tuluye
nl: Woordenboek verwijderen
pl: Odinstaluj słownik
pt_pt: Desinstalar dicionário
ru: Удалить словарь
sv: Avinstallera ordbok
vi: Gỡ cài đặt từ điển
zh_hans: 卸载字典

# command-uninstall-lexical-model-confirm
source: Would you like to uninstall this dictionary?
am: ይህንን መዝገበ ቃላት ልታጠፋው ትፈልጋለህ?
ar: هل ترغب بإزالة تثبيت هذا القاموس؟
az: Bu lüğəti silmək istəyirsiniz?
cs: Chcete odinstalovat tento slovník?
de: Möchten Sie dieses Wörterbuch deinstallieren?
el: Θὰ θέλατε νὰ ἀπεγκαταστήσετε αὐτὸ τὸ λεξικό;
es: ¿Quieres desinstalar este diccionario?
fr: Voulez-vous désinstaller ce dictionnaire ?
it: Vuoi disinstallare questo dizionario?
km: តើ​អ្នក​ចង់​លុប​បញ្ជី​ពាក្យ​នេះ​ឬ?
kn: ಈ ಶಬ್ದಕೋಶವನ್ನು ಅಸ್ಥಾಪಿಸಲು ನೀವು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?
kr: Dictionary adǝ tuluwumiya raama wa?
nl: Wil je dit woordenboek deïnstalleren?
pl: Czy chcesz odinstalować ten słownik?
pt_pt: Gostaria de desinstalar este dicionário?
ru: Вы хотите удалить этот словарь?
sv: Vill du avinstallera det här lexikonet?
vi: Bạn có muốn gỡ cài đặt từ điển này không?
zh_hans: 你想要卸载这个字典吗？

# error-loading-keyboard
source: Unable to load the requested keyboard
am: የተጠየቀው የፊደል ገበታ ሰሌዳውን ሊጫን አልተቻለም
ar: يتعذر تحميل لوحة المفاتيح المطلوبة
az: Sorğu edilmiş klaviaturanı yüklənə bilmir
cs: Požadovanou klávesnici nelze načíst
de: Die gewünschte Tastatur konnte nicht geladen werden
el: Ἀδυναμία φορτώσεως τοῦ πληκτρολογίου ποὺ ζητήσατε
es: No se puede cargar el teclado solicitado
fr: Impossible de charger le clavier demandé
it: Impossibile caricare la tastiera richiesta
km: មិនអាចផ្ទុកក្ដារចុចដែលបានស្នើទេ
kn: ವಿನಂತಿಸಿದ ಕೀಲಿಮಣೆಯನ್ನು ಲೋಡ್ ಮಾಡಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ
kr: Keyboard muradǝtǝna dǝ baworo waano
nl: Het opgevraagde toetsenbord kan niet worden geladen
pl: Nie można załadować żądanej klawiatury
pt_pt: Não foi possível carregar o teclado solicitado
ru: Не удается загрузить запрошенную клавиатуру
sv: Det gick inte att ladda det begärda tangentbordet
vi: Không thể tải được bàn phím được yêu cầu
zh_hans: 无法加载目标键盘

# error-loading-lexical-model
source: Unable to load the requested dictionary
am: የተጠየቀው ዲክሽናሪ ሊጫን አልተቻለም
ar: يتعذر تحميل القاموس المطلوب
az: Sorğu edilmiş lüğəti yüklənə bilmir
cs: Požadovaný slovník nelze načíst
de: Das gewünschte Wörterbuch konnte nicht geladen werden
el: Ἀδυναμία φορτώσεως τοῦ λεξικοῦ ποὺ ζητήσατε
es: No se puede cargar el diccionario solicitado
fr: Impossible de charger le dictionnaire demandé
it: Impossibile caricare il dizionario richiesto
km: មិនអាចផ្ទុកបញ្ជីពាក្យដែលបានស្នើទេ
kn: ವಿನಂತಿಸಿದ ಶಬ್ದಕೋಶವನ್ನು ಲೋಡ್ ಮಾಡಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ
kr: Dictionary matǝna dǝ baworo waano
nl: Het opgevraagde woordenboek kan niet worden geladen
pl: Nie można załadować żądanego słownika
pt_pt: Não foi possível carregar o dicionário solicitado
ru: Не удается загрузить запрошенный словарь
sv: Det går inte att ladda den begärda ordboken
vi: Không thể tải được từ điển được yêu cầu
zh_hans: 无法加载目标字典

# error-missing-file
source: A required file could not be found.
am: የእርዳታ ሰነዱን ማግኘት አልተቻለም።
ar: تعذر العثور على ملف مطلوب.
az: Tələb olunan fayl tapıla bilmədi.
cs: Požadovaný soubor nebyl nalezen.
de: Eine erforderliche Datei konnte nicht gefunden werden.
el: Δὲν βρέθηκε κάποιο ἀπαιτούμενο ἀρχεῖο.
es: No se ha encontrado un archivo requerido.
fr: Un fichier requis est introuvable.
it: Impossibile trovare un file richiesto.
km: មិន​អាច​រក​ឃើញ​ឯកសារ​ចាំបាច់មួយ។
kn: ಅಗತ್ಯವಿರುವ ಒಂದು ಕಡತ ಕಂಡುಬಂದಿಲ್ಲ.
kr: File tǝrawuna dǝ tǝwandǝnyi.
nl: Vereiste bestand werd niet gevonden.
pl: Nie znaleziono wymaganego pliku.
pt_pt: Não foi possível encontrar um arquivo obrigatório.
ru: Не удалось найти требуемый файл.
sv: Det gick inte att hitta en obligatorisk fil.
vi: Không thể tìm thấy tệp được yêu cầu.
zh_hans: 找不到必需文件。

# error-missing-file-critical
source: A critical file could not be found. Please try reinstalling the app.
am: ወሳኝ ፋይል ሊገኝ አልቻለም። እባክዎ መተግበሪያውን እንደገና ለመጫን ይሞክሩ።
ar: تعذر العثور على ملف جوهري. يرجى محاولة إعادة تثبيت التطبيق.
az: Kritik fayl tapıla bilmədi. Tətbiqi yenidən quraşdırmağı sınayın.
cs: Kritický soubor nebyl nalezen. Zkuste aplikaci přeinstalovat.
de: Eine erforderliche Datei konnte nicht gefunden werden. Bitte re-installieren Sie die App.
el: Κάποιο σημαντικὸ ἀρχεῖο δὲν εὑρέθη. Παρακαλοῦμε προσπαθῆστε νὰ ἐγκαταστήσετε ἐκ νέου τὴν ἐφαρμογή.
es: No se pudo encontrar un archivo crítico. Intente reinstalar la aplicación.
fr: Impossible de trouver un fichier critique. Veuillez réinstaller l'application.
it: Impossibile trovare un file critico. Prova a reinstallare l'app.
km: មិន​អាចរក​ឃើញ​ឯកសារ​សំខាន់​មួយ។ សូម​ព្យាយាម​ដំឡើង​កម្មវិធី​នេះ​ឡើង​វិញ។
kn: ಅಗತ್ಯವಿರುವ ಒಂದು ಕಡತ ಕಂಡುಬಂದಿಲ್ಲ. ದಯವಿಟ್ಟು ಅಪ್ಲಿಕೇಶನ್ ಅನ್ನು ಮರುಸ್ಥಾಪಿಸಲು ಪ್ರಯತ್ನಿಸಿ.
kr: File faidama dǝ tǝwandǝnyi. Martǝne waltǝne app dǝ ikke.
nl: Een kritisch bestand kon niet worden gevonden. Probeer de app opnieuw te installeren.
pl: Nie znaleziono pliku krytycznego. Spróbuj ponownie zainstalować aplikację.
pt_pt: Não foi possível encontrar um arquivo crítico. Por favor, tente reinstalar o aplicativo.
ru: Файл с критическим значением не найден. Пожалуйста, попробуйте переустановить приложение.
sv: Det gick inte att hitta en kritisk fil. Försök att installera om appen.
vi: Không thể tìm thấy tệp quan trọng. Xin vui lòng thử cài đặt lại ứng dụng.
zh_hans: 找不到关键文件。请尝试重新安装应用程序。

# error-query-decoding
source: The server is currently experiencing technical difficulties
am: ሰርቨሩ በአሁኑ ጊዜ ቴክኒካዊ ችግሮች እያጋጠመው ነው
ar: يعاني الخادم حاليًا من مشاكل فنية
az: Hal-hazırda server texniki çətinliklər yaşayır
cs: Server má v současné době technické problémy
de: Der Server hat derzeit technische Schwierigkeiten
el: Αὐτὴν τὴν στιγμὴ ὑπάρχουν τεχνικὰ προβλήματα στὸν διακομιστή
es: El servidor está experimentando dificultades técnicas
fr: Le serveur rencontre actuellement des difficultés techniques
it: Il server sta attualmente attraversando difficoltà tecniche
km: ម៉ាស៊ីន​មេ​កំពុង​មាន​បញ្ហា​បច្ចេកទេស
kn: ಪ್ರಸ್ತುತದಲ್ಲಿ ಸರ್ವರ್ ತಾಂತ್ರಿಕ ತೊಂದರೆಗಳನ್ನು ಎದುರಿಸುತ್ತಿದೆ
kr: Shi server dǝ kǝrma dǝro kaziyi nzundube shin mbeji
nl: De server ondervindt momenteel technische problemen
pl: Serwer ma problemy techniczne
pt_pt: O servidor está atualmente passando por dificuldades técnicas
ru: Сервер в настоящее время испытывает технические трудности
sv: Servern upplever för närvarande tekniska svårigheter
vi: Máy chủ hiện đang gặp sự cố kỹ thuật
zh_hans: 服务器目前遇到技术问题

# error-query-general
source: Error communicating with the server
am: ከሰርቨሩ ጋር መገናኘት ያልተቻለበት ችግሮች
ar: خطأ في التواصل مع الخادم
az: Serverlə əlaqə qurma xətası
cs: Chyba při komunikaci se serverem
de: Fehler bei der Kommunikation mit dem Server
el: Σημειώθηκε σφάλμα κατὰ τὴν ἐπικοινωνία μὲ τὸν διακομιστή
es: Error de comunicación con el servidor
fr: Erreur de communication avec le serveur
it: Errore di comunicazione con il server
km: មាន​បញ្ហា​ក្នុង​ការ​ទាក់ទង​ជា​មួយ​ម៉ាស៊ីន​មេ
kn: ಸರ್ವರ್‌ನೊಂದಿಗೆ ಸಂವಹನ ಮಾಡುವಲ್ಲಿ ದೋಷ ಕಂಡುಬಂದಿದೆ
kr: Taltǝ mbeji server dǝn faidatǝ ro
nl: Fout bij het communiceren met de server
pl: Błąd komunikacji z serwerem
pt_pt: Erro de comunicação com o servidor
ru: Ошибка соединения с сервером
sv: Fel vid kommunikation med servern
vi: Lỗi giao tiếp với máy chủ
zh_hans: 与服务器通信出错

# error-query-no-data
source: The server failed to respond
am: ሰርቨሩ ምላሽ ለመስጠት አልቻለም
ar: فشل الخادم في الاستجابة
az: Server cavab vermədi
cs: Server se nepodařilo odpovědět
de: Keine Antwort vom Server
el: Ὁ διακομιστὴς δὲν ἀποκρίθηκε
es: El servidor no ha respondido
fr: Le serveur n'a pas répondu
it: Il server non ha risposto
km: ម៉ាស៊ីន​មេ​មិន​បាន​ឆ្លើយ​តបទេ
kn: ಸರ್ವರ್ ಪ್ರತಿಕ್ರಿಯಿಸಲು ವಿಫಲವಾಗಿದೆ
kr: Server dǝ jawawu kalaktaro waano
nl: De server kon niet reageren
pl: Serwer nie odpowiedział
pt_pt: O servidor não conseguiu responder
ru: Сервер не ответил
sv: Servern kunde inte svara
vi: Máy chủ không trả lời
zh_hans: 服务器响应失败

# error-unknown
source: An unexpected error has occurred
am: ያልተጠበቀ ችግር ተከስቷል
ar: وقع خطأ غير متوقع
az: Gözlənilməz bir xəta baş verdi
cs: Došlo k neočekávané chybě
de: Ein unerwarteter Fehler ist aufgetreten
el: Σημειώθηκε ἀπροσδόκητο σφάλμα
es: Se ha producido un error inesperado
fr: Une erreur inattendue s’est produite
it: Si è verificato un errore inatteso
km: បញ្ហា​ឥត​រំពឹង​ទុក​មួយ​បាន​កើតឡើង
kn: ಅನಿರೀಕ್ಷಿತ ದೋಷ ಸಂಭವಿಸಿದೆ
kr: Tal tǝmatǝnyi wakazǝna
nl: Er is een onverwachte fout opgetreden
pl: Wystąpił nieoczekiwany błąd
pt_pt: Ocorreu um erro inesperado
ru: Произошла непредвиденная ошибка
sv: Ett oväntat fel har inträffat
vi: Một lỗi bất ngờ đã xảy ra
zh_hans: 发生意外错误

# error-update-no-link
source: No source for updates is available for this package
am: ለዚህ ፓኬጅ ምንም አይነት ማሻሻያ ፋይሎች አልተገኘም
ar: لا يوجد مصدر للتحديثات لهذه الحزمة
az: Bu paket üçün yeniləmə mənbəyi mövcud deyil
cs: Pro tento balíček není k dispozici žádný zdroj aktualizací
de: Keine Quelle für Aktualisierungen für dieses Paket verfügbar
el: Δὲν ὑπάρχει πηγαῖος κώδικας πρὸς ἐνημέρωσιν αὐτοῦ τοῦ πακέτου
es: No hay ninguna fuente de actualizaciones disponible para este paquete
fr: Aucune source de mise à jour n'est disponible pour ce package
it: Nessuna fonte per gli aggiornamenti è disponibile per questo pacchetto
km: គ្មាន​ប្រភព​សម្រាប់​អាប់ដេត​កញ្ចប់​នេះ​ទេ
kn: ಈ ಪ್ಯಾಕೇಜ್‌ ಅನ್ನು ನವೀಕರಿಸಲು ಯಾವುದೇ ಮೂಲ ಲಭ್ಯವಿಲ್ಲ
kr: Zawal update package adǝ ro kǝndobe dǝ bawo
nl: Er is geen bron voor updates beschikbaar voor dit pakket
pl: Brak dostępnych źródeł aktualizacji dla tego pakietu
pt_pt: Nenhuma fonte para atualizações está disponível para este pacote
ru: Источник обновлений для этого пакета не доступен
sv: Ingen källa för uppdateringar är tillgänglig för detta paket
vi: Không có nguồn dữ iệu cập nhật có sẵn cho gói này
zh_hans: 此软件包没有可用的更新源

# error-update-not-managed
source: Cannot update resource not managed by Keyman engine
am: በኪይማን ኢንጅን የማይተዳደር ሪሶርስ ማዘመን አይቻልም
ar: لا يمكن تحديث المصدر لأنه لا يديره محرك Keyman
az: Keyman mühərriki tərəfindən idarə olunmayan mənbəyi yeniləmək olmur
cs: Nelze aktualizovat dokument není spravován pomocí klávesnice
de: Ressource, die nicht von Keyman Engine verwaltet wird, kann nicht aktualisiert werden
el: Ἀδυναμία ἐνημερώσεως πόρου μὴ διαχειριζομένου ἀπὸ μηχανὴ Keyman
es: No se puede actualizar un recurso no gestionado por el motor Keyman
fr: Impossible de mettre à jour une ressource non gérée par le moteur Keyman
it: Impossibile aggiornare la risorsa non gestita dal motore Keyman
km: មិន​អាច​អាប់ដេត​ធនធាន​ដែល​មិន​ស្ថិត​ក្រោម​ការ​គ្រប់គ្រង​របស់​ម៉ាស៊ីន Keyman ទេ
kn: ಕೀಮ್ಯಾನ್ ಎಂಜಿನ್ ನಿರ್ವಹಿಸದ ಸಂಪನ್ಮೂಲವನ್ನು ನಿರ್ವಹಿಸಲು ಸಾಧ್ಯವಾಗುತ್ತಿಲ್ಲ
kr: Kare keyman engine ne cissǝyin ba dǝ raksǝ updatin zǝ sǝdin bawo
nl: Kan bron niet bijwerken niet beheerd door Keyman engine
pl: Nie można zaktualizować zasobu nie zarządzanego przez Keyman
pt_pt: Não é possível atualizar o recurso não gerenciado pelo motor Keyman
ru: Невозможно обновить ресурс, не управляемый движком Keyman
sv: Kan inte uppdatera resursen som inte hanteras av Keyman-motorn
vi: Không thể cập nhật kho dữ liệu nào không do bộ máy Keyman quản lý
zh_hans: 无法更新由Keyman引擎管理的资源

# info-command-help-keyboard
source: Keyboard help
am: የፊደል ገበታ እርዳታ
ar: مساعدة لوحة المفاتيح
az: Klaviatura köməyi
cs: Nápověda pro klávesnici
de: Hilfe zur Tastatur
el: Βοήθεια γιὰ τὸ πληκτρολόγιο
es: Ayuda del teclado
fr: Aide du clavier
it: Aiuto tastiera
km: ជំនួយ​សម្រាប់​ក្ដារចុច
kn: ಕೀಲಿಮಣೆ ಸಹಾಯ
kr: Bana Keyboard be
nl: Help bij toetsenbord
pl: Pomoc klawiatury
pt_pt: Ajuda do teclado
ru: Справка по клавиатуре
sv: Tangentbord hjälp
vi: Trợ giúp bàn phím
zh_hans: 键盘帮助

# info-command-help-lexical-model
source: Dictionary help
am: የመዝገበ ቃላት እርዳታ
ar: مساعدة القاموس
az: Lüğətə kömək
cs: Nápověda ke slovníku
de: Wörterbuch-Hilfe
el: Βοήθεια γιὰ τὸ λεξικό
es: Ayuda del diccionario
fr: Aide du dictionnaire
it: Aiuto dizionario
km: ជំនួយ​សម្រាប់​បញ្ជី​ពាក្យ
kn: ನಿಘಂಟು ಸಹಾಯ
kr: Bana Dictionary be
nl: Help bij woordenboek
pl: Pomoc słownika
pt_pt: Ajuda do dicionário
ru: Справка по словарям
sv: Hjälp med ordbok
vi: Trợ giúp từ điển
zh_hans: 字典帮助

# info-label-version-keyboard
source: Keyboard version
am: የፊደል ገበታ ሰሌዳ ስሪት፦
ar: إصدار لوحة المفاتيح
az: Klaviatura versiyası
cs: Verze klávesnice
de: Tastaturversion
el: Ἔκδοση πληκτρολογίου
es: Versión del teclado
fr: Version du clavier
it: Versione tastiera
km: ជំនាន់​ក្ដារចុច
kn: ಕೀಲಿಮಣೆ ಆವೃತ್ತಿ
nl: Toetsenbord versie
pl: Wersja klawiatury
pt_pt: Versão do teclado
ru: Версия клавиатуры
sv: Tangentbord version
vi: Phiên bản bàn phím
zh_hans: 键盘版本

# info-label-version-lexical-model
source: Dictionary version
am: የመዝገበ ቃላት ስሪት
ar: إصدار القاموس
az: Lüğət versiyası
cs: Verze slovníku
de: Wörterbuchversion
el: Ἔκδοση λεξικοῦ
es: Versión del diccionario
fr: Version du dictionnaire
it: Versione dizionario
km: ជំនាន់​បញ្ជីពាក្យ
kn: ನಿಘಂಟು ಆವೃತ್ತಿ
nl: Woordenboek versie
pl: Wersja słownika
pt_pt: Versão do dicionário
ru: Версия словаря
sv: Ordbok version
vi: Phiên bản từ điển
zh_hans: 字典版本

# installer-label-package-info
source: Package Info
am: የፓኬጅ መረጃ
ar: معلومات الحزمة
az: Paket məlumatı
cs: Informace o balíčku
de: Paket-Info
el: Πληροφορίες πακέτου
es: Información de paquete
fr: Informations sur le package
it: Info Pacchetto
km: ព័ត៌មាន​អំពី​កញ្ចប់
kn: ಪ್ಯಾಕೇಜ್ ಮಾಹಿತಿ
nl: Pakket informatie
pl: Informacje o pakiecie
pt_pt: Informações do pacote
ru: Информация о пакете
sv: Paketinformation
vi: Thông tin gói hàng
zh_hans: 软件包信息

# installer-label-select-languages
source: Select Language(s)
am: ቋንቋ(ዎች) ምረጥ
ar: اختر اللغة أو اللغات
az: Dil(lər)i seçin
cs: Vyberte jazyk(y)
de: Sprache(n) auswählen
el: Ἐπιλέξτε γλῶσσα(-ες)
es: Seleccionar idioma(s)
fr: Sélectionnez les langues
it: Seleziona Lingua(e)
km: ជ្រើសរើសភាសា(នានា)
kn: ಭಾಷೆ(ಗಳನ್ನು) ಯನ್ನು ಆಯ್ಕೆಮಾಡಿ
kr: Tǝlam(ma) karne
nl: Selecteer Talen
pl: Wybierz język(i)
pt_pt: Selecione Idioma(s)
ru: Выберите язык(и)
sv: Välj språk
vi: Chọn ngôn ngữ
zh_hans: 选择语言

# installer-label-version
source: Version: %@
am: ስሪት፦ %@
ar: الإصدار: %@
az: Versiya: %@
cs: Verze: %@
el: Ἔκδοση: %@
es: Versión: %@
it: Versione: %@
km: ជំនាន់៖ %@
kn: ಆವೃತ್ತಿ: %@
kr: Jiri: %@
nl: Versie: %@
pl: Wersja: %@
pt_pt: Versão: %@
ru: Версия: %@
vi: Phiên bản: %@
zh_hans: 版本： %@

# installer-section-available-languages
source: Available Languages
am: ያሉ ቋንቋዎች
ar: اللغات المتوفرة
az: Mövcud Dillər
cs: Dostupné jazyky
de: Verfügbare Sprachen
el: Διαθέσιμες γλῶσσες
es: Idiomas disponibles
fr: Langues disponibles
it: Lingue Disponibili
km: ភាសា​ដែលអ្នក​អាច​ប្រើបាន
kn: ಲಭ್ಯವಿರುವ ಭಾಷೆಗಳು
kr: Tǝlamma mbejima dǝ
nl: Beschikbare talen
pl: Dostępne języki
pt_pt: Idiomas Disponíveis
ru: Доступные языки
sv: Tillgängliga språk
vi: Các ngôn ngữ có sẵn
zh_hans: 可用语言

# keyboard-help-change
source: Tap here to change keyboard
am: የፊደል ገበታውን ለመቀየር እዚህ ጋር ንካ
ar: اضغط هنا لتغيير لوحة المفاتيح
az: Klaviaturanı dəyişdirmək üçün buraya toxunun
cs: Klepnutím sem změníte klávesnici
de: Hier tippen, um Tastatur zu ändern
el: Κτυπῆστε ἐδῶ γιὰ νὰ ἀλλάξετε πληκτρολόγιο
es: Pulsa aquí para cambiar el teclado
fr: Appuyez ici pour changer de clavier
it: Tocca qui per cambiare la tastiera
km: ចុច​ត្រង់​នេះ​ដើម្បី​ប្ដូរ​ក្ដារចុច
kn: ಕೀಲಿಮಣೆಯನ್ನು ಬದಲಾಯಿಸಲು ಇಲ್ಲಿ ಟ್ಯಾಪ್ ಮಾಡಿ
kr: Na adǝn ruwone keyboard dǝ faltǝ nankaro
nl: Tik hier om het toetsenbord te wijzigen
pl: Dotknij tutaj, aby zmienić klawiaturę
pt_pt: Toque aqui para alterar o teclado
ru: Нажмите здесь, чтобы изменить клавиатуру
sv: Tryck här för att ändra tangentbordet
vi: Chạm ở đây để đổi bàn phím
zh_hans: 点击此处更改键盘

# keyboard-menu-exit
source: Close %@
am: ዝጋ %@
ar: إغلاق %@
az: %@ bağla
cs: Zavřít %@
de: %@ schließen
el: Κλεῖστε τὸ %@
es: Cerrar %@
fr: Fermer %@
it: Chiudi %@
km: បិទ %@
kn: %@ ಮುಚ್ಚಿ
kr: Zanne %@
nl: %@ sluiten
pl: Zamknij %@
pt_pt: Fechar %@
ru: Закрыть %@
sv: Stäng %@
vi: Đóng %@ lại
zh_hans: 关闭 %@
