Repository: keymanapp/keyman
Catalog: ios/engine/KMEI/KeymanEngine/*.lproj/Localizable.strings
Languages: am, ar, az, cs, de, el, es, fr, it, km, kn, kr, nl, pl, pt_pt, ru, sv, vi, zh_hans

# kmp-error-file-system
source: Error installing package - file-system error
am: ጥቅልን መጫን ላይ ያሉ ችግሮች - file-system ችግሮች
ar: خطأ في تثبيت الحزمة - خطأ ملف نظام
az: Paket quraşdırma xətası - fayl sistem xətası
cs: Chyba při instalaci balíčku - chyba systému souborů
de: Fehler beim Installieren des Pakets - Dateisystemfehler
el: Σφάλμα κατά τὴν ἐγκατάσταση πακέτου - σφάλμα συστήματος ἀρχείων
es: Error al instalar el paquete - error en el sistema de archivos
fr: Erreur lors de l'installation du package - erreur système de fichiers
it: Errore nell'installazione del pacchetto - errore del file-system
km: មាន​បញ្ហា​ក្នុង​ការដំឡើង​កញ្ចប់ - បញ្ហាឯកសារ​ប្រព័ន្ធ
kn: ಪ್ಯಾಕೇಜ್ ಅನ್ನು ಸ್ಥಾಪಿಸುವಲ್ಲಿ ದೋಷವುಂಟಾಗಿದೆ - ಫೈಲ್-ಸಿಸ್ಟಮ್ (file-system) ದೋಷ
nl: Fout bij installeren pakket - bestandssysteemfout
pl: Błąd instalacji pakietu - błąd systemu plików
pt_pt: Erro ao instalar pacote - erro de arquivo-sistema
ru: Ошибка установки пакета - ошибка файловой системы
sv: Fel vid installation av paket - fel i filsystemet
vi: Lỗi cài đặt gói - lỗi hệ thống tập tin
zh_hans: 安装软件包时发生错误 - 文件系统错误

# kmp-error-file-copying
source: Error installing package - could not copy required files
am: ጥቅልን መጫን ላይ ያሉ ችግሮች - የሚያስፈልጉ ፋይሎችን መቅዳት አልቻልኩም
ar: خطأ في تثبيت الحزمة - يتعذر نسخ الملفات المطلوبة
az: Paket quraşdırma xətası - tələb olunan fayllar kopyalana bilmədi
cs: Chyba při instalaci balíčku - nelze zkopírovat požadované soubory
de: Fehler beim Installieren des Pakets - erforderliche Dateien konnten nicht kopiert werden
el: Σφάλμα κατά τὴν ἐγκατάσταση πακέτου - ἀδυναμία ἀντιγραφῆς ἀπαραιτήτων ἀρχείων
es: Error al instalar el paquete - no se pudieron copiar los archivos requeridos
fr: Erreur lors de l'installation du paquet - impossible de copier les fichiers requis
it: Errore durante l'installazione del pacchetto - impossibile copiare i file richiesti
km: មាន​បញ្ហាក្នុង​ការ​ដំឡើង​កញ្ចប់ - មិន​អាច​ចម្លង​ឯកសារ​ចាំបាច់​នានា
kn: ಪ್ಯಾಕೇಜ್ ಅನ್ನು ಸ್ಥಾಪಿಸುವಲ್ಲಿ ದೋಷವುಂಟಾಗಿದೆ - ಅಗತ್ಯವಿರುವ ಕಡತಗಳನ್ನು ನಕಲಿಸಲು ಸಾಧ್ಯವಾಗಲಿಲ್ಲ
nl: Fout bij installeren pakket - kon de vereiste bestanden niet kopiëren
pl: Błąd instalacji pakietu - nie można skopiować wymaganych plików
pt_pt: Erro ao instalar o pacote - não foi possível copiar os arquivos necessários
ru: Ошибка установки пакета - невозможно скопировать необходимые файлы
sv: Fel vid installation av paket - kunde inte kopiera obligatoriska filer
vi: Lỗi cài đặt gói - không thể copy các tập tin yêu cầu
zh_hans: 安装软件包时发生错误 - 无法复制所需文件

# kmp-error-invalid
source: The package's file is corrupted.
am: የፓኬጁ ፋይል ተበላሽቷል።
ar: ملف الحزمة معطوب.
az: Paketin faylı zədəlidir.
cs: Soubor balíčku je poškozen.
de: Die Paketdatei ist beschädigt.
el: Κατεστραμμένο ἀρχεῖο πακέτου.
es: El archivo del paquete está corrupto.
fr: Le fichier du package est corrompu.
it: Il file del pacchetto è danneggiato.
km: ឯកសារ​ក្នុង​កញ្ចប់​នេះ​ខូច​ហើយ។
kn: ಈ ಪ್ಯಾಕೇಜ್ ಕಡತದಲ್ಲಿ ದೋಷವಿದೆ.
nl: Het pakketbestand is beschadigd.
pl: Plik pakietu jest uszkodzony.
pt_pt: O arquivo do pacote está corrompido.
ru: Файл пакета повреждён.
sv: Paketets fil är skadad.
vi: Tập tin gói bị hỏng.
zh_hans: 安装包的文件已被损坏。

# kmp-error-missing
source: The specified package does not exist.
az: Müəyyənləşdirilmiş paketi mövcud deyil.
cs: Zadaný balíček neexistuje.
de: Das angegebene Keyman-Paket existiert nicht.
el: Τὸ πακέτο ποὺ ὁρίσατε δὲν ὑπάρχει.
es: El paquete especificado no existe.
fr: Le paquet spécifié n'existe pas.
it: Il pacchetto specificato non esiste.
km: គ្មានកញ្ចប់នេះទេ។
kn: ನಿರ್ದಿಷ್ಟಪಡಿಸಿದ ಪ್ಯಾಕೇಜ್ ಅಸ್ತಿತ್ವದಲ್ಲಿಲ್ಲ.
kr: Shi awoa mattǝnama dǝ bawo.
nl: Het opgegeven pakket bestaat niet.
pl: Podany pakiet nie istnieje.
pt_pt: O pacote especificado não existe.
ru: Указанный пакет не существует.
sv: Det angivna paketet finns inte.
vi: Gói được chỉ định không tồn tại.
zh_hans: 指定的程序包不存在。

# kmp-error-missing-resource
source: This package does not contain the requested keyboard or dictionary.
am: ይህ ፓኬጅ የተጠየቀውን የፊደል ገበታ ሰሌዳ ወይም መዝገበ ቃላት አልያዘም።
ar: لا تحوي هذه الحزمة على لوحة المفاتيح أو القاموس المطلوب.
az: Bu paket tələb olunan klaviatura və ya lüğəti ehtiva etmir.
cs: Tento balíček neobsahuje požadovanou klávesnici ani slovník.
de: Dieses Paket enthält nicht die angeforderte Tastatur oder Wörterbuch.
el: Αὐτὸ τὸ πακέτο δὲν περιέχει τὸ πληκτρολόγιο ἢ λεξικὸ ποὺ ζητήσατε.
es: Este paquete no contiene el teclado o el diccionario solicitado.
fr: Ce paquet ne contient pas le clavier ou le dictionnaire demandé.
it: Questo pacchetto non contiene la tastiera o il dizionario richiesto.
km: កញ្ចប់​នេះ​គ្មាន​ក្ដារចុច ឬ​បញ្ជី​ពាក្យ​ដែល​បាន​ស្នើ​សុំ​ទេ។
kn: ಈ ಪ್ಯಾಕೇಜ್‌ನಲ್ಲಿ ಉಲ್ಲೇಖಿಸಿರುವ ಕೀಲಿಮಣೆ ಅಥವ ಶಬ್ದಕೋಶವನ್ನು ಹೊಂದಿಲ್ಲ.
kr: Suro package adǝ be dǝn keyboard au dictionary matǝna dǝ bawo.
nl: Dit pakket bevat geen het opgevraagde toetsenbord of woordenboek.
pl: Ten pakiet nie zawiera żądanej klawiatury ani słownika.
pt_pt: Este pacote não contém o teclado ou dicionário solicitados.
ru: Этот пакет не содержит запрошенной клавиатуры или словаря.
sv: Detta paket innehåller inte det begärda tangentbordet eller ordboken.
vi: Gói này không chứa bàn phím hay từ điển yêu cầu.
zh_hans: 此软件包不包含要求的键盘或字典。

# kmp-error-unsupported-keyman-version
source: This package requires a newer version of Keyman.
de: Dieses Paket benötigt eine neuere Version von Keyman.
el: Αὐτὸ τὸ πακέτο ἀπαιτεῖ νεώτερη ἔκδοση τοῦ Κῆμαν.
es: Este paquete requiere una versión más reciente de Keyman.
fr: Ce paquet nécessite une version plus récente de Keyman.
it: Questo pacchetto richiede una nuova versione di Keyman.
km: កញ្ចប់នេះត្រូវការ Keyman ជំនាន់ថ្មីជាងនេះ
kn: ಈ ಪ್ಯಾಕೇಜ್‌ಗೆ ಹೊಸ ಆವೃತ್ತಿಯ ಕೀಮ್ಯಾನ್ ಅಗತ್ಯವಿದೆ.
pt_pt: Este pacote requer uma nova versão do Keyman.
vi: Gói phần mềm này yêu cầu phiên bản Keyman mới hơn.
zh_hans: 此软件包需要更新版本的Keyman。

# kmp-error-no-metadata
source: This package was not properly built - contents unknown.
am: ይህ ፓኬጅ በትክክል አልተሰራም - ይዘቶቹ አይታወቁም።
ar: لم تتم تركيب الحزمة بنجاح - محتويات غير معروفة.
az: Bu paket düzgün qurulmamışdır - məzmunu bilinmir.
cs: Tento balíček nebyl správně sestaven - obsah není znám.
de: Dieses Paket wurde nicht richtig erstellt - Inhalt unbekannt.
el: Αὐτὸ τὸ πακέτο δὲν ἔχει κατασκευασθεῖ σωστά - ὑπάρχουν ἄγνωστα περιεχόμενα.
es: Este paquete no fue compilado correctamente - contenidos desconocidos.
fr: Ce package n'a pas été correctement construit - contenu inconnu.
it: Questo pacchetto non è stato costruito correttamente - contenuti sconosciuti.
km: កញ្ចប់​នេះ​ត្រូវ​បាន​រៀបចំឡើងដោយ​មិន​សម​ស្រប - មិន​ស្គាល់​មាតិកា។
kn: ಈ ಪ್ಯಾಕೇಜ್ ಅನ್ನು ಸರಿಯಾಗಿ ನಿರ್ಮಿಸಲಾಗಿಲ್ಲ - ವಿಷಯಗಳ ಕೊರತೆಯಿದೆ.
kr: Package adǝ sha ngǝlaro tǝnandǝnyi - awo surobe dǝ notǝnyi.
nl: Dit pakket is niet goed gebouwd - de inhoud is onbekend.
pl: Ten pakiet nie został prawidłowo zbudowany - zawartość nieznana.
pt_pt: Este pacote não foi construído corretamente - conteúdo desconhecido.
ru: Этот пакет не был правильно собран - содержимое неизвестно.
sv: Paketet byggdes inte ordentligt - innehållet är okänt.
vi: Goi này không được tạo đúng cách - không rõ nội dung.
zh_hans: 此软件包未被正确构建-内容未知。

# kmp-error-unsupported
source: This package does not include support for your device.
az: Bu paket sizin cihazınız üçün dəstəyini daxil etmir.
cs: Tento balíček neobsahuje podporu pro vaše zařízení.
de: Dieses Keyman-Paket enthält keine Unterstützung für Ihr Gerät.
el: Αὐτὸ τὸ πακέτο δὲν συμπεριλαμβάνει ὑποστήριξη γιὰ τὴν συσκευή σας.
es: Este paquete no incluye asistencia para su dispositivo.
fr: Ce paquet ne prend pas en charge votre appareil.
it: Questo pacchetto non include il supporto per il tuo dispositivo.
km: កញ្ចប់នេះគ្មានឯកសារសម្រាប់ដំឡើងលើឧបករណ៍របស់អ្នកទេ។
kn: ಈ ಪ್ಯಾಕೇಜ್ ನಿಮ್ಮ ಸಾಧನಕ್ಕೆ ಬೆಂಬಲವನ್ನು ಒಳಗೊಂಡಿಲ್ಲ.
kr: Shi package dǝ device kaanǝm dǝ banajin bawo.
nl: Dit pakket bevat geen ondersteuning voor je apparaat.
pl: Ten pakiet nie zawiera wsparcia dla Twojego urządzenia.
pt_pt: Este pacote não inclui suporte para o seu dispositivo.
ru: Этот пакет не включает поддержку вашего устройства.
sv: Det här paketet innehåller inte stöd för din enhet.
vi: Gói này không bao gồm hỗ trợ cho thiết bị của bạn.
zh_hans: 此程序包不支持您的设备。

# kmp-error-wrong-type
source: This package does not contain the expected resource type.
am: ይህ ፓኬጅ የሚፈለገውን ሪሶርስ አይነት አልያዘም።
ar: لا تحتوي هذه الحزمة على نوع المصادر المطلوب.
az: Bu paketdə gözlənilən resurs növü yoxdur.
cs: Tento balíček neobsahuje očekávaný typ dokumentu.
de: Dieses Paket enthält nicht den erwarteten Ressourcentyp.
el: Αὐτὸ τὸ πακέτο δὲν περιέχει τὸν ἀναμενόμενο τύπο πόρου.
es: Este paquete no contiene el tipo de recurso esperado.
fr: Ce paquet ne contient pas le type de ressource attendu.
it: Questo pacchetto non contiene il tipo di risorsa previsto.
km: កញ្ចប់​នេះ​មិន​មាន​ប្រភេទ​ធនធានត្រឹមត្រូវ​ទេ។
kn: ಈ ಪ್ಯಾಕೇಜ್‌ನಲ್ಲಿ ನಿರೀಕ್ಷಿತ ಸಂಪನ್ಮೂಲ ಪ್ರಕಾರವನ್ನು ಒಳಗೊಂಡಿಲ್ಲ.
kr: Suro package adǝ be dǝn awoa jili tǝmamatawa dǝ bawo.
nl: Dit pakket bevat niet het verwachte type grondstof.
pl: Ten pakiet nie zawiera oczekiwanego typu zasobów.
pt_pt: Este pacote não contém o tipo de recurso esperado.
ru: Этот пакет не содержит ожидаемый тип ресурса.
sv: Detta paket innehåller inte den förväntade resurstypen.
vi: Gói này không chứa loại dữ liệu mong đợi.
zh_hans: 此软件包不包含预期的资源类型。

# menu-installed-languages-title
source: Installed Languages
am: የተጫኑ ቋንዎች
ar: اللغات المثبتة
az: Quraşdırılmış Dillər
cs: Nainstalované jazyky
de: Installierte Sprachen
el: Ἐγκατεστημένες γλῶσσες
es: Idiomas instalados
fr: Langues installées
it: Lingue Installate
km: ភាសា​នានា​ដែល​បាន​ដំឡើង
kn: ಸ್ಥಾಪಿಸಲಾಗಿರುವ ಭಾಷೆಗಳು
kr: Tǝlamma tǝkkǝ
nl: Geïnstalleerde talen
pl: Zainstalowane języki
pt_pt: Idiomas instalados
ru: Установленные языки
sv: Installerade språk
vi: Các ngôn ngữ đã cài đặt
zh_hans: 已安装的语言

# menu-langsettings-label-lexical-models
source: Dictionaries
am: መዝገበ ቃላት
ar: القواميس
az: Lüğətlər
cs: Slovníky
de: Wörterbücher
el: Λεξικά
es: Diccionarios
fr: Dictionnaires
it: Dizionari
km: បញ្ជី​ពាក្យនានា
kn: ಶಬ್ದಕೋಶಗಳು
nl: Woordenboeken
pl: Słowniki
pt_pt: Dicionários
ru: Словари
sv: Ordböcker
vi: Từ điển
zh_hans: 字典

# menu-langsettings-section-keyboards
source: Keyboards
am: የፊደል ገበታዎች
ar: لوحة المفاتيح
az: Klaviaturalar
cs: Klávesnice
de: Tastaturen
el: Πληκτρολόγια
es: Teclados
fr: Claviers
it: Tastiere
km: ក្ដារចុច
kn: ಕೀಲಿಮಣೆಗಳು
nl: Toetsenborden
pl: Klawiatury
pt_pt: Teclados
ru: Клавиатуры
sv: Tangentbord
vi: Bàn phím
zh_hans: 键盘

# menu-langsettings-section-settings
source: Language Settings
am: የቋንቋ ስሪቶች
ar: إعداد اللغة
az: Dil parametrləri
cs: Nastavení jazyka
de: Spracheinstellungen
el: Ρυθμίσεις γλώσσας
es: Configuración de idioma
fr: Paramètres de langue
it: Impostazioni Lingua
km: ការកំណត់​ភាសា
kn: ಭಾಷಾ ಸಂಯೋಜನೆಗಳು
nl: Taal instellingen
pl: Ustawienia języka
pt_pt: Configurações de idioma
ru: Настройки языка
sv: Inställningar för språk
vi: Cài đặt ngôn ngữ
zh_hans: 语言设置

# menu-langsettings-title
source: %@ Settings
am: %@ ስሪቶች
ar: إعدادات %@
az: %@ Parametrləri
cs: %@ nastavení
de: %@ Einstellungen
el: Ρυθμίσεις %@
es: %@ Configuración
fr: Paramètres de %@
it: Impostazioni %@
km: ការកំណត់ %@
kn: %@ ಸೆಟ್ಟಿಂಗ್‌ಗಳು
nl: %@ instellingen
pl: %@ Ustawieni as
pt_pt: Configurações de %@
ru: Настройки %@
sv: %@ Inställningar
vi: Cài đặt %@
zh_hans: %@ 设置

# menu-langsettings-toggle-correct
source: Enable corrections
am: እርማቱን ያብሩ
ar: تفعيل التصحيحات
az: Düzəlişləri fəallaşdır
cs: Povolit opravy
de: Korrekturen aktivieren
el: Ἐνεργοποιῆστε τὶς διορθώσεις
es: Habilitar correcciones
fr: Activer les corrections
it: Abilita correzioni
km: បើក​ការកែពាក្យ
kn: ತಿದ್ದುಪಡಿಗಳನ್ನು ಸಕ್ರಿಯಗೊಳಿಸಿ
nl: correcties inschakelen
pl: Włącz korekcję
pt_pt: Habilitar correções
ru: Включить исправления
sv: Aktivera korrigeringar
vi: Bật hiệu chỉnh
zh_hans: 启用校正

# menu-langsettings-toggle-predict
source: Enable predictions
am: ትንበያውን ያብሩ
ar: تفعيل التوقعات
az: Təxminləri fəallaşdır
cs: Povolit predikce
de: Vorhersagen aktivieren
el: Ἐνεργοποιῆστε τὶς προβλέψεις κειμένου
es: Habilitar predicciones
fr: Activer les prédictions
it: Abilita previsioni
km: បើក​ការណែនាំពាក្យ​ស្វ័យប្រវត្តិ
kn: ಮುಂದಿನ ಪದವನ್ನು ಊಹಿಸಲು ಸಕ್ರಿಯಗೊಳಿಸಿ
nl: Schakel voorspellingen in
pl: Włącz przewidywania
pt_pt: Habilitar previsões
ru: Включить прогнозы
sv: Aktivera förutsägelser
vi: Bật tiên đoán
zh_hans: 启用预测

# menu-lexical-model-install-message
source: Would you like to install this dictionary?
am: ይህንን መዝገበ ቃላት ልትጭነው ትፈልጋለህ?
ar: هل ترغب بتثبيت هذا القاموس؟
az: Bu lüğəti quraşdırmaq istəyirsiniz?
cs: Chcete nainstalovat tento slovník?
de: Möchten Sie dieses Wörterbuch installieren?
el: Θὰ θέλατε νὰ ἐγκαταστήσετε αὐτὸ τὸ λεξικό;
es: ¿Quieres instalar este diccionario?
fr: Voulez-vous installer ce dictionnaire ?
it: Vuoi installare questo dizionario?
km: តើ​អ្នក​ចង់​ដំឡើង​បញ្ជី​ពាក្យ​នេះ​ឬ?
kn: ಈ ಶಬ್ದಕೋಶವನ್ನು ಸ್ಥಾಪಿಸಲು ನೀವು ಖಚಿತವಾಗಿ ಬಯಸುವಿರಾ?
kr: Dictionary ikkǝmiya raamma wa?
nl: Wil je dit woordenboek installeren?
pl: Czy chcesz zainstalować ten słownik?
pt_pt: Gostaria de instalar este dicionário?
ru: Вы хотите установить этот словарь?
sv: Vill du installera denna ordbok?
vi: Bạn có muốn cài đặt từ điển này không?
zh_hans: 您想要安装这个字典吗？

# menu-lexical-model-none-message
source: No dictionaries available
am: መዝገበ ቃላት የለም
ar: لا تتوفر قواميس
az: Heç bir lüğət yoxdur
cs: Žádné slovníky nejsou k dispozici
de: Keine Wörterbücher verfügbar
el: Δὲν ὑπάρχουν διαθέσιμα λεξικά
es: No hay diccionarios disponibles
fr: Aucun dictionnaire disponible
it: Nessun dizionario disponibile
km: គ្មាន​បញ្ជី​ពាក្យ​ទេ
kn: ಯಾವುದೇ ಶಬ್ದಕೋಶಗಳು ಲಭ್ಯವಿಲ್ಲ
kr: Dictionary ba
nl: Geen woordenboeken beschikbaar
pl: Brak dostępnych słowników
pt_pt: Nenhum dicionário disponível
ru: Нет доступных словарей
sv: Inga ordböcker tillgängliga
vi: Không có từ điển nào
zh_hans: 没有可用的字典

# menu-lexical-model-title
source: %@ Dictionaries
am: %@ መዝገበ ቃላቶች
ar: قواميس %@
az: %@ Lüğətləri
cs: %@ slovníků
de: %@ Wörterbücher
el: %@ Λεξικά
es: %@ Diccionarios
fr: Dictionnaires %@
it: %@ Dizionari
km: បញ្ជី​ពាក្យ %@
kn: %@ ಶಬ್ದಕೋಶಗಳು
nl: %@ Woordenboeken
pl: %@ Słowniki
pt_pt: %@ Dicionários
ru: %@ словаря
sv: %@ ordböcker
vi: %@ Từ điển
zh_hans: %@ 字典

# menu-picker-title
source: Keyboards
am: የፊደል ገበታዎች
ar: لوحات مفاتيح
az: Klaviaturalar
cs: Klávesnice
de: Tastaturen
el: Πληκτρολόγια
es: Teclados
fr: Claviers
it: Tastiere
km: ក្ដារចុច
kn: ಕೀಲಿಮಣೆಗಳು
nl: Toetsenborden
pl: Klawiatury
pt_pt: Teclados
ru: Клавиатуры
sv: Tangentbord
vi: Bàn phím
zh_hans: 键盘

# menu-settings-error-report
source: Allow Error Reporting
am: ችግሮቹን ማሳዋቂያውን ፍቀድ
ar: السماح بالإبلاغ عن الأخطاء
az: Xəta bildirməyə icazə ver
cs: Povolit hlášení chyb
de: Fehlerberichte erlauben
el: Ἐπιτρέψτε ἀναφορὲς σφαλμάτων
es: Permitir reporte de error
fr: Autoriser les rapports d'erreurs
it: Consenti Segnalazione Errori
km: អនុញ្ញាត​ឱ្យ​រាយការណ៍​ពី​បញ្ហា
kn: ದೋಷ ವರದಿ ಮಾಡಲು ಅನುಮತಿ ನೀಡಿ
nl: Foutrapportage toestaan
pl: Zezwalaj na raportowanie błędów
pt_pt: Permitir Relatório de Erros
ru: Разрешить сообщение об ошибках
sv: Tillåt felrapportering
vi: Cho phép báo lỗi
zh_hans: 允许错误报告

# menu-settings-error-report-description
source: May require "full access"
am: ሙሉ አክሰስ ሊያስፈልገው ይችላል
ar: قد تطلب "الوصول الكامل"
az: "Tam müraciət" tələb edə bilər
cs: Může vyžadovat "plný přístup"
de: Kann "Vollzugriff" erfordern
el: Μπορεῖ νὰ ἀπαιτηθεῖ "πλήρης πρόσβαση"
es: Puede requerir "acceso completo"
fr: Peut nécessiter un "accès complet"
it: Può richiedere "pieno accesso"
km: អាច​ត្រូវ​ការ "សិទ្ធិ​ចូលប្រើ​ពេញ​លេញ"
kn: "ಪೂರ್ಣ ಪ್ರವೇಶ" ("full access") ಅನುಮತಿ ಬೇಕಾಗಬಹುದು
nl: Kan volledige toegang vereisen
pl: Może wymagać "pełnego dostępu"
pt_pt: Pode exigir "acesso total"
ru: Может потребоваться "полный доступ"
sv: Kan kräva "full åtkomst"
vi: Có thể yêu cầu "toàn quyền truy cập"
zh_hans: 可能需要“完全访问”

# menu-settings-install-from-file
source: Install From File
am: ከፋይልህ ውስጥ ጫን
ar: تثبيت من الملف
az: Fayldan quraşdırın
cs: Instalovat ze souboru
de: Aus Datei installieren
el: Ἐγκαταστῆστε ἀπὸ ἀρχεῖο
es: Instalar desde archivo
fr: Installer depuis un fichier
it: Installa Da File
km: ដំឡើង​ពី​ឧបករណ៍
kn: ಕಡತದಿಂದ ಅನುಸ್ಥಾಪಿಸು
kr: File dǝn gine ikke
nl: Installeren vanuit bestand
pl: Zainstaluj z pliku
pt_pt: Instalar do arquivo
ru: Установить из файла
sv: Installera från fil
vi: Cài đặt từ file
zh_hans: 从文件安装

# menu-settings-install-from-file-description
source: Browse for .kmp files
am: .kmp ፋይል አሳይ
ar: البحث عن ملفات .kmp
az: .kmp fayllarını axtar
cs: Procházet .kmp soubory
de: Durchsuche nach .kmp Dateien
el: Ψάξτε ἀρχεῖα .kmp
es: Buscar archivos .kmp
fr: Parcourir pour des fichiers .kmp
it: Esplora i file .kmp
km: រុក​រកឯកសារ .kmp
kn: .kmp ಕಡತಗಳಿಗಾಗಿ ಬ್ರೌಸ್ ಮಾಡಿ
nl: Blader naar .kmp bestanden
pl: Przeglądaj pliki .kmp
pt_pt: Procurar por arquivos .kmp
ru: Поиск файлов .kmp
sv: Bläddra efter .kmp-filer
vi: Tìm các tập tin .kmp
zh_hans: 浏览 .kmp 文件

# menu-settings-system-keyboard-menu
source: System Keyboard Settings
am: የሲስተሙን የፊደል ገበታ ቅንብሮች
ar: إعدادات لوحة مفاتيح النظام
az: Sistem Klaviatura Parametrləri
cs: Nastavení klávesnice systému
de: Systemtastatur Einstellungen
el: Ρυθμίσεις πληκτρολογίου συστήματος
es: Configuración del teclado del sistema
fr: Paramètres du clavier système
it: Impostazioni Tastiera Di Sistema
km: ការកំណត់​ក្ដារចុច​ប្រព័ន្ធ
kn: ಸಿಸ್ಟಮ್ ಕೀಲಿಮಣೆ ಸೆಟ್ಟಿಂಗ್‌ಗಳು
nl: Systeem toetsenbord instellingen
pl: Ustawienia klawiatury systemowej
pt_pt: Configurações do teclado
ru: Системные настройки клавиатуры
sv: Systeminställningar för tangentbord
vi: Cài đặt Hệ thống Bàn phím
zh_hans: 系统键盘设置

# menu-settings-show-banner
source: Show Banner
am: ባነሩን አሳይ
ar: إظهار الشارة
az: Banneri göstər
cs: Zobrazit banner
de: Banner anzeigen
el: Νὰ ἐμφανίζεται Banner
es: Mostrar banner
fr: Afficher la bannière
it: Mostra Banner
km: បង្ហាញ​បដា
kn: ಬ್ಯಾನರ್ ತೋರಿಸು
nl: Toon Banner
pl: Pokaż baner
pt_pt: Mostrar banner
ru: Показать баннер
sv: Visa banner
vi: Hiển thị biểu ngữ
zh_hans: 显示横幅

# menu-settings-startup-get-started
source: Show 'Get Started' at startup
am: በሚጀምርበት ሰዓት "Get Started" የሚለውን አሳይ
ar: عرض 'شاشة البدأ' عند التشغيل
az: Başlanğıcda 'Başlayın' göstər
cs: Zobrazit 'Začíná' při startu
de: "Erste Schritte" beim Start anzeigen
el: Νὰ ἐμφανίζεται ἡ ἐναρκτήρια ὀθόνη κατὰ τὴν ἐκκίνηση
es: Mostrar "Comenzar" al inicio
fr: Toujours afficher « Démarrer» au démarrage
it: Mostra 'Inizia' all'avvio
km: បង្ហាញ "ចាប់ផ្ដើម" ពេល​បើក​កម្មវិធី
kn: ಆರಂಭದಲ್ಲಿ "ಪ್ರಾರಂಭಿಕ ಪರದೆ" ತೋರಿಸು
kr: 'Badizǝna' fulezǝ sa wastǝna dǝn
nl: Toon 'Begin' bij het opstarten
pl: Pokaż 'Rozpocznij' przy starcie
pt_pt: Mostrar 'Começar' na inicialização
ru: Показывать 'Начало работы' при запуске
sv: Visa 'Kom igång' vid start
vi: Hiển thị 'Bắt đầu' ở startup
zh_hans: 启动时显示 '开始'

# menu-settings-title
source: Keyman Settings
am: የኪይማን ቅንብሮች
ar: إعدادات Keyman
az: Keyman Parametrləri
cs: Nastavení klíče
de: Keyman Einstellungen
el: Ρυθμίσεις Κῆμαν
es: Configuración de Keyman
fr: Paramètres Keyman
it: Impostazioni Keyman
km: ការកំណត់ Keyman
kn: ಕೀಮ್ಯಾನ್ ಸೆಟ್ಟಿಂಗ್‌ಗಳು
nl: Sleutelman Instellingen
pl: Ustawienia Keyman
pt_pt: Configurações do Keyman
ru: Настройки Keyman
sv: Keyman inställningar
vi: Cài đặt Keyman
zh_hans: Keyman 设置

# menu-settings-spacebar-hint-blank
source: Do not show caption on spacebar
am: የስፔስባሩ መግለጫ ጽሁፍ አታሳይ
ar: لا تعرض النص عند الضغط على مفتاح المسافة
az: Ara düyməsində mətni göstərilməsin
cs: Nezobrazovat titulek v mezerníku
de: Beschriftung auf Leertaste nicht anzeigen
el: Καμμία λεζάντα στὸ πλῆκτρο διαστήματος
es: No mostrar el título en la barra espaciadora
fr: Ne pas afficher la légende sur la barre d'espace
it: Non mostrare la didascalia sulla barra spaziatrice
km: កុំបង្ហាញពាក្យលើគ្រាប់ចុចដកឃ្លា
kn: ಸ್ಪೇಸ್‌ಬಾರ್ ಶೀರ್ಷಿಕೆ ತೋರಿಸಬೇಡ
kr: Wande fuwu dǝn awoa dǝana dǝ ruwotǝnyi
nl: Onderschrift niet weergeven op spatiebalk
pl: Nie pokazuj podpisu na spacji
pt_pt: Não mostrar legenda na barra de espaço
ru: Не показывать заголовок в пробеле
sv: Visa inte bildtext på mellanslagstangenten
vi: Không hiển thị gì trên phím cách
zh_hans: 空格键无提示

# menu-settings-spacebar-hint-keyboard
source: Show keyboard name on spacebar
am: የፊደል ገበታ ሰሌዳውን ስም በስፔስ ባሩ ላይ አሳይ
ar: أظهر اسم لوحة المفاتيح على مفتاح المسافة
az: Klaviatura adı ara düyməsində göstərilsin
cs: Zobrazit název klávesnice v mezerníku
de: Tastaturnamen auf Leertaste anzeigen
el: Ὄνομα πληκτρολογίου στὸ πλῆκτρο διαστήματος
es: Mostrar nombre del teclado en la barra espaciadora
fr: Afficher le nom du clavier sur la barre d'espace
it: Mostra il nome della tastiera nella barra spaziatrice
km: បង្ហាញឈ្មោះក្ដារចុចលើគ្រាប់ចុចដកឃ្លា
kn: ಕೀಲಿಮಣೆಯ ಹೆಸರನ್ನು ಸ್ಪೇಸ್‌ಬಾರ್ ಶೀರ್ಷಿಕೆಯನ್ನಾಗಿ ತೋರಿಸು
kr: Su keyboard ye dǝ spacebar dǝn fulezǝ
nl: Toetsenbord naam weergeven op spatiebalk
pl: Pokaż nazwę klawiatury na spacji
pt_pt: Mostrar o nome do teclado na barra de espaço
ru: Показывать имя клавиатуры на пробеле
sv: Visa tangentbordsnamn på mellanslag
vi: Hiển thị tên bàn phím trên phím cách
zh_hans: 空格键上显示键盘名称

# menu-settings-spacebar-hint-language
source: Show language name on spacebar
am: የቋንቋውን ስም በስፔስ ባሩ ላይ አሳይ
ar: أظهر اسم اللغة عند ضغط المسافة
az: Dil adı ara düyməsində göstərilsin
cs: Zobrazit název jazyka v mezerníku
de: Sprache auf Leertaste anzeigen
el: Ὄνομα γλώσσας στὸ πλῆκτρο διαστήματος
es: Mostrar el nombre del idioma en la barra espaciadora
fr: Afficher le nom de la langue dans la barre d'espace
it: Mostra il nome della lingua nella barra spaziatrice
km: បង្ហាញឈ្មោះភាសាលើគ្រាប់ចុចដកឃ្លា
kn: ಭಾಷೆಯನ್ನು ಸ್ಪೇಸ್‌ಬಾರ್ ಶೀರ್ಷಿಕೆಯನ್ನಾಗಿ ತೋರಿಸು
kr: Su tǝlambe dǝ spacebar dǝn fuletǝ
nl: Taalnaam op spatiebalk weergeven
pl: Pokaż nazwę języka na spacji
pt_pt: Mostrar nome do idioma na barra de espaço
ru: Показывать название языка в пробеле
sv: Visa språknamn på mellanslag
vi: Hiển thị tên ngôn ngữ trên phím cách
zh_hans: 空格键上显示语言名称

# menu-settings-spacebar-hint-languageKeyboard
source: Show language and keyboard name on spacebar
am: ቋንቋና የፊደል ገበታውን በስፔስ ባሩ ላይ
ar: أظهر اسم اللغة ولوحة المفاتيح عند على مفتاح المسافة
az: Dil və klaviatura adı ara düyməsində göstərilsin
cs: Zobrazit název jazyka a klávesnice v mezerníku
de: Sprache und Tastaturnamen auf Leertaste anzeigen
el: Ὄνομα πληκτρολογίου καὶ γλώσσας στὸ πλῆκτρο διαστήματος
es: Mostrar el idioma y el nombre del teclado en la barra espaciadora
fr: Afficher la langue et le nom du clavier sur la barre d'espacement
it: Mostra la lingua e il nome della tastiera nella barra spaziatrice
km: បង្ហាញឈ្មោះក្ដារចុច និងភាសានៅលើគ្រាប់ចុចដកឃ្លា
kn: ಭಾಷೆ ಮತ್ತು ಕೀಲಿಮಣೆ ಸ್ಪೇಸ್‌ಬಾರ್ ಶೀರ್ಷಿಕೆಯನ್ನಾಗಿ ತೋರಿಸು
kr: Su tǝlambe dǝa keyboard ye dǝa ndiso spacebar dǝn fuletǝ
nl: Taal- en toetsenbordnaam op spatiebalk weergeven
pl: Pokaż język i nazwę klawiatury na spacji
pt_pt: Mostrar idioma e nome do teclado na barra de espaço
ru: Показывать язык и название клавиатуры на пробеле
sv: Visa språk och tangentbordsnamn på mellanslag
vi: Hiển thị ngôn ngữ và bàn phím trên phím cách
zh_hans: 空格键上显示语言和键盘名称

# menu-settings-spacebar-text
source: Spacebar Caption
am: የስፔስባሩ መግለጫ ጽሁፍ
ar: نص مفتاح المسافة
az: Ara düymənin mətni
cs: Popisek mezerníku
de: Leertasten-Beschriftung
el: Λεζάντα Πλήκτρου Διαστήματος
es: Leyenda del teclado
fr: Légende de la barre d'espace
it: Didascalia Barra Spaziale
km: ពាក្យលើគ្រាប់ចុចដកឃ្លា
kn: ಸ್ಪೇಸ್‌ಬಾರ್ ಶೀರ್ಷಿಕೆ
kr: Su spacebar dǝn ruwotin dǝ
nl: Spatiebalk bijschrift
pl: Podpis paska spacji
pt_pt: Barra de espaço
ru: Заголовок пробела
sv: Bildtext för mellanslag
vi: Tên phím khoảng cách
zh_hans: 空格键提示

# menu-settings-spacebar-title
source: Spacebar Caption
am: የስፔስባሩ መግለጫ ጽሁፍ
ar: نص مفتاح المسافة
az: Ara düymənin mətni
cs: Popisek mezerníku
de: Leertasten-Beschriftung
el: Λεζάντα Πλήκτρου Διαστήματος
es: Leyenda del teclado
fr: Légende de la barre d'espace
it: Didascalia Barra Spaziale
km: ពាក្យលើគ្រាប់ចុចដកឃ្លា
kn: ಸ್ಪೇಸ್‌ಬಾರ್ ಶೀರ್ಷಿಕೆ
kr: Su spacebar dǝn ruwotin dǝ
nl: Spatiebalk bijschrift
pl: Podpis paska spacji
pt_pt: Barra de espaço
ru: Заголовок пробела
sv: Bildtext för mellanslag
vi: Tên phím khoảng cách
zh_hans: 空格键提示
