Repository: keymanapp/keyman
Catalog: ios/engine/KMEI/KeymanEngine/*.lproj/Localizable.strings
Languages: am, ar, az, cs, de, el, es, fr, it, km, kn, kr, nl, pl, pt_pt, ru, sv, vi, zh_hans

# menu-settings-spacebar-item-blank
source: Blank
am: ባዶ
ar: فارغ
az: Boş
cs: Prázdné
de: Leer
el: Κενό
es: Vacío
fr: Vide
it: Vuoto
km: ទទេ
kn: ಖಾಲಿ
kr: Desul
nl: Leeg
pl: Puste
pt_pt: Vazio
ru: Пустой
sv: Tom
vi: Trống
zh_hans: 空白

# menu-settings-spacebar-item-keyboard
source: Keyboard
am: የፊደል ገበታ ሰሌዳ
ar: لوح مفاتيح
az: Klaviatura
de: Tastatur
el: Πληκτρολόγιο
es: Teclado
fr: Clavier
km: ក្ដារចុច
kn: ಕೀಲಿಮಣೆ
pt_pt: Teclado
ru: Клавиатура
vi: Bàn phím
zh_hans: 键盘

# menu-settings-spacebar-item-language
source: Language
am: ቋንቋ
ar: اللغة
az: Dil
cs: Jazyk
de: Sprache
el: Γλῶσσα
es: Idioma
fr: Langue
it: Lingua
km: ភាសា
kn: ಭಾಷೆ
kr: Tǝlam
nl: Taal
pl: Język
pt_pt: Idioma
ru: Язык
sv: Språk
vi: Ngôn ngữ
zh_hans: 语言

# menu-settings-spacebar-item-languageKeyboard
source: Language and keyboard
am: ቋንቋና የፊደል ገበታ
ar: اللغة ولوحة المفاتيح
az: Dil və klaviatura
cs: Jazyk a klávesnice
de: Sprache und Tastatur
el: Γλῶσσα καὶ πληκτρολόγιο
es: Idioma y teclado
fr: Langue et clavier
it: Lingua e tastiera
km: ភាសា និងក្ដារចុច
kn: ಭಾಷೆ ಮತ್ತು ಕೀಲಿಮಣೆ
kr: Tǝlamma kuru keyboard wa
nl: Taal en toetsenbord
pl: Język i klawiatura
pt_pt: Idioma e teclado
ru: Язык и клавиатура
sv: Språk och tangentbord
vi: Ngôn ngữ và bàn phím
zh_hans: 语言和键盘

# menu-settings-adjust-keyboard-height
source: Adjust Keyboard Height
es: Ajustar altura del teclado
vi: Điều chỉnh độ cao bàn phím

# button-label-reset-default-keyboard-height
source: Reset to Default Keyboard Height
es: Restablecer a la altura predeterminada del teclado
vi: Đặt lại Chiều cao bàn phím mặc định

# keyboard-drag-instructions
source: Drag arrow control to adjust keyboard height.
es: Arrastre el control de flecha para ajustar la altura del teclado.
vi: Kéo mũi tên để điều chỉnh chiều cao bàn phím.

# portrait-keyboard-rotate-instructions
source: Rotate device to adjust for landscape.
es: Gira el dispositivo para ajustarlo al formato horizontal.
vi: Xoay thiết bị để điều chỉnh theo chiều ngang.

# landscape-keyboard-rotate-instructions
source: Rotate device to adjust for portrait.
es: Gira el dispositivo para ajustarlo en vertical.
vi: Xoay thiết bị để điều chỉnh theo chiều dọc.

# notification-download-failure-keyboard
source: Keyboard download failed
am: የፊደል ገበታ ሰሌዳ መውረድ አልቻለም
ar: فشل تحميل لوحة المفاتيح
az: Klaviatura endirilmədi
cs: Stahování klávesnice se nezdařilo
de: Download der Tastatur fehlgeschlagen
el: Ἡ μεταφόρτωση τοῦ πληκτρολογίου ἀπέτυχε
es: Error al descargar el teclado
fr: Le téléchargement du clavier a échoué
it: Download tastiera non riuscito
km: មិន​អាច​ទាញ​យក​ក្ដារចុច​បាន​ទេ
kn: ಕೀಲಿಮಣೆ ಡೌನ್‌ಲೋಡ್ ಮಾಡಲು ವಿಫಲವಾಗಿದೆ
kr: Keyboard download dǝ waano
nl: Toetsenbord downloaden mislukt
pl: Pobieranie klawiatury nie powiodło się
pt_pt: Download do teclado falhou
ru: Ошибка загрузки клавиатуры
sv: Tangentbords nedladdning misslyckades
vi: Tải bàn phím thất bại
zh_hans: 键盘下载失败

# notification-download-failure-lexical-model
source: Dictionary download failed
am: መውረድ ቃላቱ መውረድ አልቻለም
ar: فشل تحميل لوحة المفاتيح
az: Lüğət endirilmədi
cs: Stahování slovníku selhalo
de: Download des Wörterbuchs fehlgeschlagen
el: Ἡ μεταφόρτωση τοῦ λεξικοῦ ἀπέτυχε
es: Error al descargar el diccionario
fr: Le téléchargement du dictionnaire a échoué
it: Download del dizionario non riuscito
km: មិន​អាច​ទាញយក​បញ្ជី​ពាក្យ​បាន​ទេ
kn: ಶಬ್ದಕೋಶವನ್ನು ಡೌನ್‌ಲೋಡ್ ಮಾಡಲು ವಿಫಲವಾಗಿದೆ
kr: Dictionary download dǝ waano
nl: Downloaden van woordenboek mislukt
pl: Pobieranie słownika nie powiodło się
pt_pt: Download do dicionário falhou
ru: Ошибка загрузки словаря
sv: Nedladdning av ordbok misslyckades
vi: Tải từ điển thất bại
zh_hans: 字典下载失败

# notification-download-success-keyboard
source: Keyboard successfully downloaded
am: የፊደል ገበታው በጥሩ ሁኔታ ወርዷል
ar: تم تحميل لوحة المفاتيح بنجاح
az: Klaviatura uğurla endirildi
cs: Klávesnice úspěšně stažena
de: Tastatur erfolgreich heruntergeladen
el: Τὸ πληκτρολόγιο μεταφορτώθηκε ἐπιτυχῶς
es: Teclado descargado correctamente
fr: Le clavier a été téléchargé avec succès
it: Tastiera scaricata con successo
km: បាន​ទាញ​យក​ក្ដារចុច​ដោយ​ជោគជ័យ
kn: ಕೀಲಿಮಣೆ ಯಶಸ್ವಿಯಾಗಿ ಡೌನ್‌ಲೋಡ್ ಪೂರ್ಣಗೊಂಡಿದೆ
kr: Keyboard dǝ ba downloadnzǝ dǝ dazǝna
nl: Toetsenbord succesvol gedownload
pl: Pomyślnie pobrano klawiaturę
pt_pt: Teclado baixado com sucesso
ru: Клавиатура успешно загружена
sv: Tangentbordet har laddats ner
vi: Tải bàn phím thành công
zh_hans: 键盘下载成功

# notification-download-success-lexical-model
source: Lexical model successfully downloaded
am: ሌክሲካል ሞዴሉ በጥሩ ሁኔታ ወርዷል
ar: تم تحميل النموذج الاصطلاحي بنجاح
az: Leksik model uğurla endirildi
cs: Lexický model byl úspěšně stažen
de: Wörterbuch erfolgreich heruntergeladen
el: Τὸ λεξιλογικὸ μοντέλλο μεταφορτώθηκε ἐπιτυχῶς
es: Modelo léxico descargado correctamente
fr: Le modèle lexical a été téléchargé avec succès
it: Modello lessicale scaricato con successo
km: បាន​ទាញ​យក​គំរូ​វាក្យសព្ទ​ (Lexical model) ដោយ​ជោគជ័យ
kn: ಶಬ್ದಕೋಶದ ಮಾದರಿ ಯಶಸ್ವಿಯಾಗಿ ಡೌನ್‌ಲೋಡ್ ಪೂರ್ಣಗೊಂಡಿದೆ
kr: Lexical model dǝ ba downloadnzǝ dazǝna
nl: Lexisch model succesvol gedownload
pl: Model Lexical został pomyślnie pobrany
pt_pt: Modelo Léxico baixado com sucesso
ru: Лексическая модель успешно загружена
sv: Lexikal modell har laddats ner
vi: Tải từ điển thành công
zh_hans: Lexical 模型下载成功

# notification-downloading-keyboard
source: Downloading keyboard…
am: የፊደል ገበታው እይወረደ ነው…
ar: يجري تحميل لوحة مفاتيح…
az: Klaviatura endirilir…
cs: Stahování klávesnice…
de: Tastatur wird heruntergeladen…
el: Μεταφορτώνεται πληκτρολόγιο…
es: Descargando teclado…
fr: Téléchargement du clavier…
it: Scaricamento tastiera…
km: កំពុង​ទាញ​យកក្ដារចុច…
kn: ಕೀಲಿಮಣೆಯನ್ನು ಡೌನ್‌ಲೋಡ್ ಮಾಡಲಾಗುತ್ತಿದೆ…
nl: Toetsenbord downloaden…
pl: Pobieranie klawiatury…
pt_pt: Baixando teclado…
ru: Загрузка клавиатуры…
sv: Laddar ner tangentbord…
vi: Đang tải về bàn phím…
zh_hans: 正在下载键盘…

# notification-downloading-lexical-model
source: Downloading dictionary…
am: መዝገበ ቃላቱ እይወረደ ነው…
ar: يجري تحميل لوحة مفاتيح…
az: Lüğət endirilir…
cs: Stahování slovníku…
de: Wörterbuch wird heruntergeladen…
el: Μεταφορτώνεται λεξικό…
es: Descargando diccionario…
fr: Téléchargement du dictionnaire en cours…
it: Scaricamento dizionario…
km: កំពុង​ទាញ​យកបញ្ជី​ពាក្យ…
kn: ಶಬ್ದಕೋಶವನ್ನು ಡೌನ್‌ಲೋಡ್ ಮಾಡಲಾಗುತ್ತಿದೆ…
nl: Woordenboek downloaden…
pl: Pobieranie słownika…
pt_pt: Baixando o dicionário…
ru: Загрузка словаря…
sv: Laddar ner ordbok…
vi: Đang tải về từ điển…
zh_hans: 正在下载字典…

# notification-update-available
source: Update Available
am: ማሻሻያዎች ይገኛሉ
ar: يتوفر تحديث
az: Yeniləmə mövcuddur
cs: Dostupná aktualizace
de: Update verfügbar
el: Διαθέσιμη Ἐνημέρωση
es: Actualización disponible
fr: Mise à jour disponible
it: Aggiornamento Disponibile
km: មាន​ការអាប់ដេត
kn: ನವೀಕರಣ ಲಭ್ಯವಿದೆ
kr: Update mbeji
nl: Update beschikbaar
pl: Aktualizacja dostępna
pt_pt: Atualização disponível
ru: Доступно обновление
sv: Uppdatering tillgänglig
vi: Có bản cập nhật mới
zh_hans: 有可用的更新

# notification-update-processing
source: Updating…
am: እየዘመነ ነው …
ar: يجري تحديث…
az: Yenilənir…
cs: Aktualizace…
de: Aktualisiere…
el: Ἐνημέρωση σὲ ἐξέλιξη…
es: Actualizando…
fr: Mise à jour en cours…
it: Aggiornamento…
km: កំពុង​អាប់ដេត…
kn: ನವೀಕರಿಸಲಾಗುತ್ತಿದೆ…
nl: Bijwerken…
pl: Aktualizowanie…
pt_pt: Atualizando…
ru: Обновление…
sv: Uppdaterar…
vi: Đang cập nhật…
zh_hans: 正在更新…

# success-install
source: Installed successfully.
am: በጥሩ ሁኔታ ተጭኗል።
ar: تم التثبيت بنجاح.
az: Uğurla quraşdırıldı.
cs: Úspěšně nainstalováno.
de: Erfolgreich installiert.
el: Ἐπιτυχὴς ἐγκατάσταση.
es: Instalado correctamente.
fr: Installé avec succès.
it: Installato con successo.
km: បានដំឡើងដោយជោគជ័យ។
kn: ಯಶಸ್ವಿಯಾಗಿ ಸ್ಥಾಪಿಸಲಾಗಿದೆ.
kr: Ba gawuna.
nl: Met succes geïnstalleerd.
pl: Pomyślnie zainstalowany.
pt_pt: Instalado com sucesso.
ru: Успешно установлено.
sv: Installationen lyckades.
vi: Đã cập nhật thành công.
zh_hans: 安装成功。

# success-title
source: Success
am: ተሳክቷል
ar: نجحت العملية
az: Uğurlu
cs: Úspěšně
de: Erfolgreich
el: Ἐπιτυχία
es: Completado
fr: Succès
it: Successo
km: ជោគជ័យ
kn: ಯಶಸ್ವಿಯಾಗಿದೆ
kr: Kǝnasar
nl: Geslaagd
pl: Sukces
pt_pt: Sucesso
ru: Успешно
sv: Klart
vi: Thành công
zh_hans: 成功

# alert-error-title
source: Error
am: ችግሮች
ar: خطأ
az: Xəta
cs: Chyba
de: Fehler
el: Σφάλμα
fr: Erreur
it: Errore
km: បញ្ហា
kn: ದೋಷ
kr: Taltǝ
nl: Foutmelding
pl: Błąd
pt_pt: Erro
ru: Ошибка
sv: Fel
vi: Lỗi
zh_hans: 错误
