Repository: keymanapp/keyman
Catalog: linux/keyman-config/locale/*.po
Languages: ar_sa

source: Neither sentry-sdk nor raven is available. Not enabling Sentry error reporting.
ar_sa: لا يتوفر pentry-sdk ولا raven. تم إبطال الإبلاغ عن الأخطاء إلى Sentry.

source: Download Keyman keyboards
ar_sa: تحميل لوحات مفاتيح Keyman

source: _Close
ar_sa: _إغلاق

source: You do not have permissions to install the keyboard files to the shared area /usr/local/share/keyman
ar_sa: ليس لديك الأذونات لتثبيت ملفات لوحة المفاتيح في المسار المشترك /usr/local/share/keyman

source: You do not have permissions to install the documentation to the shared documentation area /usr/local/share/doc/keyman
ar_sa: ليس لديك الأذونات لتنصيب ملفات المساعدة في مسار ملفات المساعدة المشترك /usr/local/share/doc/keyman

source: You do not have permissions to install the font files to the shared font area /usr/local/share/fonts
ar_sa: ليس لديك الإذن لتثبيت ملفات الخطوط في مسار الخطوط المشترك /usr/local/share/fonts

source: install_kmp.py: error: No kmp.json or kmp.inf found in {package}
ar_sa: install_kmp.py: خطأ: لا يوجد kmp.json أو kmp.inf في {package}

source: install_kmp.py: error: No kmp.json or kmp.inf found in {packageFile}
ar_sa: install_kmp.py: خطأ: لا يوجد kmp.json أو kmp.inf في {packageFile}

source: Installing keyboard/package {keyboardid}
ar_sa: يجري تثبيت لوحة المفاتيح/الحزمة {keyboardid}

source: Keyboard is installed already
ar_sa: لوحة المفاتيح مثبتة بالفعل

source: The {name} keyboard is already installed at version {version}. Do you want to uninstall then reinstall it?
ar_sa: لوحة مفاتيح {name} مثبتة بالفعل بالإصدار {version}. هل ترغب بإزالتها وإعادة تثبيتها؟

source: The {name} keyboard is already installed with a newer version {installedversion}. Do you want to uninstall it and install the older version {version}?
ar_sa: لوحة المفاتيح {name} مثبتة بالفعل بإصدار أحدث {installedversion}. هل تريد إلغاء تثبيتها وتثبيت الإصدار القديم {version}؟

source: Keyboard layouts:
ar_sa: مخططات لوحات المفاتيح:

source: Fonts:
ar_sa: الخطوط:

source: Package version:
ar_sa: إصدار الحزمة:

source: Author:
ar_sa: المنشئ:

source: Website:
ar_sa: الموقع:

source: Copyright:
ar_sa: حقوق النشر:

source: Details
ar_sa: التفاصيل

source: README
ar_sa: اقرأني

source: _Install
ar_sa: _تثبيت

source: _Cancel
ar_sa: _إلغاء

source: Keyboard {name} installed
ar_sa: تم تثبيت لوحة مفاتيح {name}

source: Keyboard {name} could not be installed.
ar_sa: تعذر تثبيت لوحة مفاتيح {name}.

source: Error Message:
ar_sa: رسالة الخطأ:

source: Warning Message:
ar_sa: رسالة تحذير:

source: {name} keyboard
ar_sa: لوحة مفاتيح {name}

source: ERROR: Keyboard metadata is damaged. Please "Uninstall" and then "Install" the keyboard.
ar_sa: خطأ: بيانات وصف لوحة المفاتيح متضررة. يرجى "إزالة تثبيت" وثم "تثبيت" لوحة المفاتيح.

source: Package name:
ar_sa: اسم الحزمة:

source: Package id:
ar_sa: معرّف الحزمة:

source: Package description:
ar_sa: وصف الحزمة:

source: Package author:
ar_sa: منشئ الحزمة:

source: Package copyright:
ar_sa: حقوق نشر الحزمة:

source: Keyboard filename:
ar_sa: اسم ملف لوحة المفاتيح:

source: Keyboard name:
ar_sa: اسم لوحة المفاتيح:

source: Keyboard id:
ar_sa: معرّف لوحة المفاتيح:

source: Keyboard version:
ar_sa: إصدار لوحة المفاتيح:

source: Keyboard author:
ar_sa: منشئ لوحة المفاتيح:

source: Keyboard license:
ar_sa: رخصة لوحة المفاتيح:

source: Keyboard description:
ar_sa: وصف لوحة المفاتيح:

source: Scan this code to load this keyboard on another device or <a href='{uri}'>share online</a>
ar_sa: امسح هذا الرمز لتحميل لوحة المفاتيح على جهاز آخر أو<a href='{uri}'>شارك على الإنترنت</a>

source: {packageId} Settings
ar_sa: إعدادات {packageId}

source: Keyman Configuration
ar_sa: تكوين Keyman

source: Choose a kmp file...
ar_sa: اختر ملف kmp...

source: KMP files
ar_sa: ملفات KMP

source: Icon
ar_sa: أيقونة

source: Name
ar_sa: الاسم

source: Version
ar_sa: الإصدار

source: _Uninstall
ar_sa: _إلغاء تثبيت

source: Uninstall keyboard
ar_sa: إلغاء تثبيت لوحة مفاتيح

source: _About
ar_sa: _حول

source: About keyboard
ar_sa: حول لوحة المفاتيح

source: _Help
ar_sa: _مساعدة

source: Help for keyboard
ar_sa: مساعدة للوحة المفاتيح

source: _Options
ar_sa: _خيارات

source: Settings for keyboard
ar_sa: خيارات للوحة المفاتيح

source: _Refresh
ar_sa: _تحديث

source: Refresh keyboard list
ar_sa: تحديث قائمة لوحة المفاتيح

source: _Download
ar_sa: _تحميل

source: Download and install a keyboard from the Keyman website
ar_sa: تحميل وتثبيت لوحة مفاتيح من موقع Keyman

source: Install a keyboard from a file
ar_sa: تثبيت لوحة مفاتيح من ملف

source: Close window
ar_sa: إغلاق النافذة

source: Uninstall keyboard {package}
ar_sa: إزالة تثبيت لوحة مفاتيح {package}

source: Help for keyboard {package}
ar_sa: مساعدة للوحة مفاتيح {package}

source: About keyboard {package}
ar_sa: حول لوحة مفاتيح {package}

source: Settings for keyboard {package}
ar_sa: إعدادات لوحة مفاتيح {package}

source: Uninstall keyboard package?
ar_sa: إزالة حزمة لوحة المفاتيح؟

source: Are you sure that you want to uninstall the {keyboard} keyboard and its fonts?
ar_sa: هل أنت متأكد من أنك ترغب بإزالة تثبيت لوحة مفاتيح {keyboard} وخطوطها؟

source: {name} installed
ar_sa: {name} مثبت

source: Open in _Web browser
ar_sa: فتح في _مستعرض الإنترنت

source: Open in the default web browser to do things like printing
ar_sa: فتح في مستعرض الإنترنت الأساسي للقيام بأشياء مثل الطباعة

source: _OK
ar_sa: _موافق
